In [3]:

import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/austinlasseter/plotly_dash_tutorial/master/00%20resources/titanic.csv')

In [5]:
df.head()

   Unnamed: 0  Survived  Pclass     Sex   Age     Fare     Embarked
0           0         0       3    male  22.0   7.2500  Southampton
1           1         1       1  female  38.0  71.2833    Cherbourg
2           2         1       3  female  26.0   7.9250  Southampton
3           3         1       1  female  35.0  53.1000  Southampton
4           4         0       3    male  35.0   8.0500  Southampton

In [4]:
df.columns

Index(['Unnamed: 0', 'Survived', 'Pclass', 'Sex', 'Age', 'Fare', 'Embarked'], dtype='object')

In [5]:
df.dtypes

Unnamed: 0      int64
Survived        int64
Pclass          int64
Sex            object
Age           float64
Fare          float64
Embarked       object
dtype: object

In [9]:
df['Embarked'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown'], dtype=object)